{
  "i_am": "Eu sou um ",
  "br": "Brasil",
  "about_desc": "Criativo, dedicado e sempre disposto a aprender. Me contrata aí e te faço o melhor macarrão na chapa (ou seu dinheiro de volta).",
  "race": "Raça",
  "class": "Classe",
  "human": "Humano",
  "about": "Sobre",
  "tech": "Tech",
  "technologies": "Tecnologias",

  "my_projects": "Alguns dos meus projetos",
  "pr_message_board_desc": "Quadro de mensagens imitando algumas das funcionalidades de uma rede social, como: Cadastro e acesso de usuários, perfil, posts, likes.",
  "pr_weather_app_desc": "Aplicação de previsão do clima que faz uso da API pública do openWeather.",
  "pr_virtual_assistant_desc": "Assistente pessoal customizável, com reconhecimento de voz e texto para fala.",
  "pr_focus_point_desc": "Aplicação \"Tudo em um\" com ferramentas para organização e gerenciamento de tempo. Desenvolvimento focado para mobile.",
  "pr_cool_rainbows_desc": "Um dos meus primeiros códigos, feito por aprendizagem e diversão. Se trata de um color switcher em js vanilla",
  "get_in_touch": "Entre em contato",
  "email": "E-mail",
  "name": "Nome",
  "subject": "Assunto",
  "message": "Mensagem",
  "send": "Enviar",
  "and": "e",

  "title_experience": "Experiência",
  "title_projects": "Projetos",
  "title_contact": "Entre em contato :)",

  "landing1": "Me chamo Leonel, sou apaixonado por tecnologia e estou sempre buscando aprender algo novo.",
  "landing2": "Atuo como desenvolvedor full-stack há alguns anos e durante esse tempo tive a oportunidade de trabalhar com diversas tecnologias.",
  "landing3": "Atualmente, venho buscado me aprofudar na área de cybersegurança. Estou fazendo treinamentos no",
  "landing4": "me familiarizando com técnicas e ferramentas usadas na exploração de vulnerabilidades web, assim como a mitigação e prevenção.",
  "landing5": "Desejo desenvolver o conhecimento prático e teórico necessário para atuar na área.",
  "landing6": "Indo um pouco além sou um pai orgulhoso e, no meu tempo livre: artista, tatuador, aspirante a escritor, gamer, entre outras coisas.",
  "landing7": "Sinta-se à vontade para entrar em contato comigo",
  "get_contact": "Entre em contato",

  "tech1": "Como já foi dito, durante minha trajetória no desenvolvimento tive a oportunidade de trabalhar com diversas linguagens e tecnologias. Dentre eles, posso destacar o uso de: Javascript principalmente através do framework React, Node, Python e Laravel. \n Também me aventurei na criação de jogos na engine Unity, utilizando C#. Chegando a atuar na área por um breve período como professor substituto. \n Apesar de ainda ter muito o que aprender, posso dizer que trabalhei com diferentes Design Patterns. Sempre tentando me atentar aos conceitos do SOLID e código limpo para desenvolver um código limpo, reutilizável e escalável.",
  "tech2": "Venho estudando Cybersegurança diariamente e completando CTFs, principalmente nas plataformas TryHackMe e Portswigger. O que tem me permitido desenvolver muito conhecimento teórico, mas também aplicá-los na prática e botando a mão na massa.",
  "tech3": "Utilizo Linux desde antes do ínicio da minha carreira na TI e estou bem familiarizado e confortável com um shell. Utilizo o Mint (e também o Kali) no meu dia-a-dia, mas já brinquei com outras distribuições.",
  "tech4": "Tenho experiência utilizando bancos de dados relacionais como MySQL e Postgres, interagindo com eles manualmente e através de ORMs como Eloquent e Sequelize. \n Tenho facilidade e controle do versionamento com o Git, e também lidando com containers do Docker.",
  "tech5": "Hosteei aplicações full-stack em VMs no Compute Engine do GCP, configurando Nginx como proxy reverso e utilizando pm2 para persistência da aplicação. \n Implementei APIs Restful, muitas vezes utilizando ferramentas como Postman para testá-las. ",
  "tech6": "Quase ou tão importante quanto, sou uma pessoa criativa e dedicada. Todo dia e todo obstáculo é uma oportunidade para se aprender algo novo. Nossos maiores aliados são o Google e as documentações, e sou capaz de pesquisar e navegar por eles :)",
  "see_more": "Ver mais",
  "seen_all": "Entre outras coisas",
  "tech_stack": "Um pouco do meu repertório",

  "professional": "Profissional",
  "academic": "Acadêmica",
  "complementary": "Complementar",
  "full_dev": "desenvolvedor full-stack",
  "ux_designer": "UX/UI designer",
  "cybersec_enthusiast": "entusiasta de cybersegurança",
  "artist_designer": "artista e designer",
  "tattooer": "tatuador",
  "writer_wannabe": "aspirante a escritor",
  "comp_tech": "Técnico de informática",
  "sub_teacher": "Professor substituto de programação",
  "freela_art": "Freelancing Artes e Design",
  "waiter": "Garçom",
  "software_engineering": "Engenharia de Software",
  "ead_info_sys": "EaD Sistemas de informação",
  "bi_arts_design": "B.I em Artes e Design",
  "modern_web_dev": "Desenvolvimento Web Moderna",
  "art_expos": "Exposições artísticas",
  "present": "presente",
  "interrupted": "[Interrompido]",
  "desc_fmu": "Implementação de novas features, resolução de bugs e manutenção do código na corrida pela digitalização da empresa e substituição de sistemas legados.",
  "desc_health": "Além de atuar com desenvolvimento também auxiliava em questões de UI e UX. Durante meu tempo na Health ID pude crescer muito profissionalmente. ",
  "desc_ibx": "Realizava os reparos necessários, que iam desde uma simples formatação até a troca de peças. O contrato foi encerrado prematuramente devido a complicações da pandemia.",
  "desc_happy": "Criação do material e preparo das aulas de programação, com enfoque em jogos, ministradas para público infanto-juvenil.",
  "desc_art": "Buscando entender as necessidades dos meus clientes, aplicava os meus conhecimentos de forma criativa, visando entregas inovadoras e de qualidade.",
  "desc_expo_art": "Exposição de algumas pinturas de minha autoria em diferentes bares e studios da minha cidade.",
  "desc_thm_path": "Em curso: Complete beginner; SOC1 \n Completos: Introduction to cyber-security; Pre-security",
  "desc_fiap_cybersec": "Esse curso da FIAP aborda os pilares da cibersegurança e sua aplicação para proteger sistemas. Alguns dos tópicos envolvem criptografia, análise de vulnerabilidades, engenharia social e frameworks para testes de intrusão.",

  "err_invalid_email": "Por favor, insira um email válido",
  "err_subject_length": "O assunto deve ter no máximo 255 caracteres",
  "err_message_length": "A mensagem deve ter no máximo 512 caracteres",
  "err_required_field": "Este campo é obrigatório",
  "contact_toast_success": "Enviado com sucesso, te respondo já já!",
  "contact_toast_error": "Ixe, falha ao enviar mensagem!"
}
