{
  "i_am": "Eu sou um ",
  "br": "Brasil",
  "about_desc": "Criativo, dedicado e sempre disposto a aprender. Me contrata aí e te faço o melhor macarrão na chapa (ou seu dinheiro de volta).",
  "race": "Raça",
  "class": "Classe",
  "human": "Humano",
  "about": "Sobre",
  "tech": "Tech",
  "technologies": "Tecnologias",

  "my_projects": "Alguns dos meus projetos",
  "pr_message_board_desc": "Quadro de mensagens imitando algumas das funcionalidades de uma rede social, como: Cadastro e acesso de usuários, perfil, posts, likes.",
  "pr_weather_app_desc": "Aplicação de previsão do clima que faz uso da API pública do openWeather.",
  "pr_virtual_assistant_desc": "Assistente pessoal customizável, com reconhecimento de voz e texto para fala.",
  "pr_focus_point_desc": "Aplicação \"Tudo em um\" com ferramentas para organização e gerenciamento de tempo. Desenvolvimento focado para mobile.",
  "pr_cool_rainbows_desc": "Um dos meus primeiros códigos, feito por aprendizagem e diversão. Se trata de um color switcher em js vanilla.",
  "pr_lazyos_desc": "Ferramenta para enumeração de subdomínios via Osint.",
  "get_in_touch": "Entre em contato",
  "email": "E-mail",
  "name": "Nome",
  "subject": "Assunto",
  "message": "Mensagem",
  "send": "Enviar",
  "and": "e",

  "title_experience": "Experiência",
  "title_projects": "Projetos pessoais",
  "title_contact": "Entre em contato :)",

  "landing1": "Me chamo Leonel, sou apaixonado por tecnologia e estou sempre buscando aprender algo novo.",
  "landing2": "Atuo como desenvolvedor full-stack há alguns anos e durante esse tempo tive a oportunidade de trabalhar com diversas tecnologias.",
  "landing3": "Atualmente, busco me especializar em cibersegurança. Estou fazendo treinamentos no",
  "landing4": "me familiarizando com técnicas e ferramentas usadas na exploração de vulnerabilidades, assim como a mitigação e prevenção. E, desejo uma oportunidade de ingressar na área.",
  "landing5": "Como programador, utilizo os conhecimentos adquiridos para construir aplicações mais seguras e resilientes.",
  "landing6": "Indo um pouco além sou um pai orgulhoso e, no meu tempo livre: artista, tatuador, aspirante a escritor, gamer, gamedev, entre outras coisas.",
  "landing7": "Sinta-se à vontade para entrar em contato comigo",
  "get_contact": "Entre em contato",

  "tech0": "Nos meus quatro anos de experiência pude trabalhar com diversas linguages e tecnologias, participando ativamente da construção de soluções.",
  "tech1": "Experiência no front-end com React e gerenciamento de estado avançado com Redux e Hooks.",
  "tech2": "Experiência sólida no back-end utilizando Laravel, Python (Flask e Django), e NodeJS.",
  "tech3": "Desenvolvimento de APIs e RESTful APIs. Experiência também com integrações, por exemplo, com o Gateway da Getnet.",
  "tech4": "Modelagem de bancos de dados e atuação com bancos relacionais como MySQL e PostgreSQL e ORMs. Também tive contato com MongoDB.",
  "tech5": "Adoção de boas práticas de desenvolvimento, versionamento e segurança: SOLID, TDD, Gitflow, OWASP, NIST SSDF.",
  "tech6": "Experiência com soluções e conceitos de infraestrutura, incluindo Docker, NGINX, Google Cloud Platform e pipelines de CI/CD.",
  "tech7": "Conhecimento e vivência com ambientes GNU/Linux e Bash.",
  "tech8": "Metodologias ágeis como Scrum e entendimento do ciclo de desenvolvimento de software.",
  "tech9": "Quase ou tão importante quanto, sou uma pessoa criativa e dedicada e com fome de conhecimento, estou sempre disposto e buscando aprender coisas novas.",

  "see_more": "Ver mais",
  "seen_all": "Entre outras coisas",
  "tech_stack": "Um pouco do meu repertório",

  "professional": "Profissional",
  "academic": "Acadêmica",
  "complementary": "Certificados e complementares",
  "full_dev": "Desenvolvedor Full Stack PL",
  "anl_dev": "Analista de TI PL",
  "ux_designer": "UX/UI designer",
  "full_dev_title": "Desenvolvedor full stack",
  "cybersec_enthusiast": "Entusiasta de cibersegurança",
  "artist_designer": "Artista e designer",
  "tattooer": "tatuador",
  "writer_wannabe": "aspirante a escritor",
  "comp_tech": "Técnico de informática",
  "sub_teacher": "Professor substituto de programação",
  "freela_art": "Freelancing Artes e Design",
  "waiter": "Garçom",
  "software_engineering": "Engenharia de Software",
  "ead_info_sys": "EaD Sistemas de informação",
  "bi_arts_design": "B.I em Artes e Design",
  "modern_web_dev": "Desenvolvimento Web Moderna",
  "art_expos": "Exposições artísticas",
  "present": "presente",
  "interrupted": "[Interrompido]",
  "desc_fmu": "●​ Desenvolvimento de uma plataforma para experiência e gestão de professores, utilizando Next.JS e Node.JS, com integração ao Microsoft EntraID via OAuth2.\n●​ Contribuição ativa no planejamento e desenvolvimento do processo de rematrícula de alunos, também utilizando o ecossistema Javascript. Identifiquei e corrigi uma falha crítica na lógica de negócio.\n●​ Integração com a plataforma de pagamentos Getnet e monitoramento de logs de erro e fraude.\n●​ Configuração de ambientes de produção e realização de deploys na Google Cloud Platform (GCP).",
  "desc_health": "●​ Fomos a primeira Healthtech a implementar o modelo de testes Anywhere Lab no Brasil.\n●​ Desenvolvimento de uma plataforma para uma grande operadora de saúde, que colocou os beneficiários em um cuidado coordenado baseado em suas necessidades, utilizando análise preditiva e cálculo de riscos de saúde. Usamos Laravel em ambiente Docker e React no front-end. Também adotamos GraphQL para reduzir a carga no servidor e melhorar a eficiência.\n●​ Criação de uma plataforma de governança utilizando nossa stack principal: Laravel, React e GraphQL. Implementei autenticação com JWT, upload de arquivos e armazenamento na Amazon S3.\n●​ Implementação de diversas melhorias e correções de bugs na plataforma de seguros da Expermed. Por exemplo, criação de consultas SQL para novos tipos de relatórios exportados em PDF.\n●​ Desenvolvimento de uma plataforma de educação em saúde voltada para professores e profissionais da educação.\n●​ Prototipação de soluções de UI/UX no Figma com foco em design intuitivo e centrado no usuário.",
  "desc_wisedata": "●​ Planejamento e desenvolvimento de sistemas do zero para os mais diversos segmentos.\n●​ Atualmente desenvolvendo um sistema de NPS que integra múltiplos canais de comunicação, utilizando RabbitMQ para uma gestão eficiente de filas.",
  "desc_happy": "● Criação do material e preparo das aulas de programação, com enfoque em jogos, ministradas para público infanto-juvenil.",
  "desc_art": "● Buscando entender as necessidades dos meus clientes, aplicava os meus conhecimentos de forma criativa, visando entregas inovadoras e de qualidade.",
  "desc_expo_art": "Exposição de algumas pinturas de minha autoria em diferentes bares e studios da minha cidade.",
  "desc_thm_path": "CTFs são desafios práticos onde se deve empregar diversas técnicas de segurança cibernética para capturar uma \"bandeira\". Learning Paths são caminhos de aprendizado composto por aulas e materiais auxiliares. ",
  "desc_fiap_cybersec": "Esse curso da FIAP aborda os pilares da cibersegurança e sua aplicação para proteger sistemas. Alguns dos tópicos envolvem criptografia, análise de vulnerabilidades, engenharia social e frameworks para testes de intrusão.",
  "fiap_cybersec": "Certificado Cybersecurity",
  "google_cybersec": "Certificado Profissional de Segurança Cibernética",
  "desc_google_cybersec": "Esta certificação é composta de oito cursos, que abordam diversos tópicos, como: conceitos essenciais da cibersegurança; frameworks e boas práticas, CISSP, NIST CSF, OWASP; Detecção de ameaças, ferramentas SIEM e SOAR; responder a incidentes de segurança; identificação de vulnerabilidades; hardening; automatização de tarefas e análise de dados com Python e MySQL; ambientes GNU/Linux.",

  "err_invalid_email": "Por favor, insira um email válido",
  "err_subject_length": "O assunto deve ter no máximo 255 caracteres",
  "err_message_length": "A mensagem deve ter no máximo 512 caracteres",
  "err_required_field": "Este campo é obrigatório",
  "contact_toast_success": "Enviado com sucesso, te respondo já já!",
  "contact_toast_error": "Ixe, falha ao enviar mensagem!"
}
