{
  "i_am": "I'm a ",
  "br": "Brazil",
  "about_desc": "Creative, dedicated and always willing to learn. Hire me and I'll make the best pasta on the plate that you've eaten (or your money back).",
  "race": "Race",
  "class": "Class",
  "human": "Human",
  "about": "About",
  "tech": "Tech",
  "technologies": "Technologies",

  "my_projects": "Some of my projects",
  "pr_message_board_desc": "Message board mimicking some of common social network features, such as: User registration and access, profile, posts, likes.",
  "pr_weather_app_desc": "Weather forecast application that makes use of the openWeather public API.",
  "pr_virtual_assistant_desc": "Customizable personal assistant with voice recognition and text-to-speech.",
  "pr_focus_point_desc": "\"All in one\" application bundled with tools for organization and time management. Mobile focused development.",
  "pr_cool_rainbows_desc": "One of my first codes pushed to github, made for learning and fun. Basically a color switcher in vanilla js.",
  "pr_lazyos_desc": "Osint subdomain enumerator tool.",
  "get_in_touch": "Get in touch with me",
  "email": "Email",
  "name": "Name",
  "subject": "Subject",
  "message": "Message",
  "send": "Send",
  "and": "and",

  "title_experience": "Experience",
  "title_projects": "Personal projects",
  "title_contact": "Get in touch :)",

  "landing1": "My name is Leonel, I'm passionate about tech and always looking for something new to learn.",
  "landing2": "I work as a full-stack dev for a few years now and during this time I had the opportunity to work with a lot of tech and languages.",
  "landing3": "Currently, I’m aiming to specialize in cybersecurity. I’m undergoing training at",
  "landing4": "getting familiar with techniques and tools used in vulnerability exploitation, as well as mitigation and prevention. I’m seeking an opportunity to enter the field.",
  "landing5": "As a programmer, I apply the knowledge I’ve acquired to build more secure and resilient applications.",
  "landing6": "Going a little further, I am a proud father and, in my free time: artist, tattoo artist, writer wannabe, gamer, gamedev, among other things.",
  "landing7": "Feel free to get in touch with me",
  "get_contact": "Get in touch",

  "tech0": "In my four years of experience, I’ve worked with various languages and technologies, actively contributing to the development of solutions.",
  "tech1": "Front-end experience with React and advanced state management using Redux and Hooks.",
  "tech2": "Solid back-end experience using Laravel, Python (Flask and Django), and NodeJS.",
  "tech3": "API and RESTful API development. Also experienced with integrations, such as with the Getnet Gateway.",
  "tech4": "Database modeling and work with relational databases like MySQL and PostgreSQL and ORMs. I’ve also worked with MongoDB.",
  "tech5": "Adoption of best practices in development, version control, and security: SOLID, TDD, Gitflow, OWASP, NIST SSDF.",
  "tech6": "Experience with infrastructure solutions and concepts, including Docker, NGINX, Google Cloud Platform, and CI/CD pipelines.",
  "tech7": "Knowledge and experience with GNU/Linux environments and Bash.",
  "tech8": "Agile methodologies such as Scrum and understanding of the software development lifecycle.",
  "tech9": "Almost or just as important, I am a creative and dedicated person with a hunger for knowledge, always willing and seeking to learn new things.",
  "see_more": "See more",
  "seen_all": "Among other things",
  "tech_stack": "Some of my repertory",

  "professional": "Professional",
  "academic": "Education",
  "complementary": "Certificates and complementary",
  "full_dev": "Mid-level Full Stack Developer",
  "anl_dev": "Mid-level IT Analyst",
  "full_dev_title": "Full stack developer",
  "ux_designer": "UX Designer",
  "cybersec_enthusiast": "Cybersecurity enthusiast",
  "artist_designer": "Artist and designer",
  "tattooer": "Tattooer",
  "writer_wannabe": "Writer wannabe",
  "comp_tech": "Computer technician",
  "sub_teacher": "Substitute programming teacher",
  "freela_art": "Freelancing Arts and Design",
  "waiter": "Waiter",
  "software_engineering": "Software Engineering",
  "ead_info_sys": "EaD Information Systems",
  "bi_arts_design": "I.B in Arts and Design",
  "modern_web_dev": "Modern Web Development",
  "art_expos": "Artistic expositions",
  "present": "present",
  "interrupted": "[Interrupted]",
  "desc_fmu": "●​ Developed a platform for teachers experience and management, using Next.JS and Node.JS. Also integrating with Microsoft EntraID using OAuth2.\n●​ Actively contributed to the planning and development of students re-enrollment also using the Javascript ecosystem. Where I've also identified and fixed a critical business logic flaw.\n●​ Integrated with Getnet payment gateway and monitored error and fraud logs.\n●​ Configured production environments and performed deployments on Google Cloud Platform (GCP).",
  "desc_health": "●​ We were the first Healthtech to implement the Anywhere Lab tests business model in Brazil.\n●​ Developed a platform for a large health insurance company, that put the beneficiaries on a coordinated care based on their needs, using predictive analysis and calculated health risks. Using Laravel on a docker environment and React on the front-end. We've also adopted GraphQL in order to reduce server workload and improve efficiency.\n●​ Kickstarted a governance platform using our main stack: Laravel, React and GraphQL. I've also implemented JWT authentication, file upload and storage on Amazon S3.\n●​ Implemented multiple improvements and bug fixes in Expermed’s insurance platform. For example, the creation of SQL queries for new report types that were exported to PDF.\n●​ Developed a health education platform aimed at teachers and education professionals.\n●​ Prototyped UI/UX solutions in Figma with a focus on intuitive and user-centered design.",
  "desc_wisedata": "●​ Planning and development of systems from scratch for the most diverse segments.\n●​ Currently building an NPS system that integrates multiple communication channels, leveraging RabbitMQ for efficient queue management.",
  "desc_happy": "● Creation of materials and preparation of programming classes focused on games, taught to children and teenagers.",
  "desc_art": "● Seeking to understand my clients’ needs, I applied my knowledge creatively, aiming for innovative and high-quality deliveries.",
  "desc_expo_art": "Exhibition of some of my paintings in different bars and studios in my city.",
  "desc_thm_path": "CTFs are practical challenges where various cybersecurity techniques must be employed to capture a \"flag\". Learning Paths are learning tracks composed of lessons and supporting materials.",
  "desc_fiap_cybersec": "This FIAP course covers the pillars of cybersecurity and its application to protect systems. Topics include encryption, vulnerability analysis, social engineering, and frameworks for intrusion testing.",
  "fiap_cybersec": "Cybersecurity Certification",
  "google_cybersec": "Cyber ​​Security Professional Certification",
  "desc_google_cybersec": "This certification is made up of eight courses, which cover various topics, such as: essential cybersecurity concepts; frameworks and best practices, CISSP, NIST CSF, OWASP; Threat detection, SIEM and SOAR tools; responding to security incidents; identifying vulnerabilities; hardening; automating tasks and analyzing data with Python and MySQL; GNU/Linux environments.",

  "err_invalid_email": "Please enter a valid email address",
  "err_subject_length": "Subject must be 255 characters or less",
  "err_message_length": "Message must be 512 characters or less",
  "err_required_field": "This field is required",
  "contact_toast_success": "Sent successfully, I'll get back to you soon!",
  "contact_toast_error": "Error sending message!"
}
