{
  "i_am": "Je suis a",
  "br": "Brazil",
  "about_desc": "Créatif, dévoué et toujours prêt à apprendre. Embauchez-moi et je préparerai les meilleures pâtes dans l'assiette que vous aurez mangées (ou vous serez remboursé).",
  "race": "Course",
  "class": "Classe",
  "human": "Humain",
  "about": "À propos",
  "journey": "Voyage",
  "projects": "Projets",
  "tech": "Tech",
  "technologies": "Les technologies",
  "tech_stack": "Langues et technologie avec lesquelles je travaille ou ai travaillé",
  "tools_stack": "Outils et plateformes que j'utilise ou ai utilisés",
  "contact": "Contact",
  "professional": "Professionnel",
  "academic": "Académique",
  "complementary": "Complémentaire",
  "full_dev": "Développeur full-stack",
  "ux_designer": "Concepteur UX",
  "cybersec_enthusiast": "Passionné de cybersécurité",
  "artist_designer": "Artiste et Designer",
  "tattooer": "Tatoueur",
  "writer_wannabe": "Écrivain en herbe",
  "comp_tech": "Technicien informatique",
  "sub_teacher": "Professeur de programmation suppléant",
  "freela_art": "Arts et design indépendants",
  "waiter": "Serveur",
  "software_engineering": "Génie logiciel",
  "ead_info_sys": "EaD Systèmes d'information",
  "bi_arts_design": "B.I en Arts et Design",
  "art_expos": "Expositions Artistiques",
  "modern_web_dev": "Développement Web moderne",
  "my_projects": "Certains de mes projets",
  "pr_message_board_desc": "Tableau de messages imitant certaines fonctionnalités courantes des réseaux sociaux, telles que: l'enregistrement et l'accès des utilisateurs, le profil, les publications, les likes.",
  "pr_weather_app_desc": "Application de prévisions météorologiques qui utilise l'API publique openWeather.",
  "pr_virtual_assistant_desc": "Assistant personnel personnalisable avec reconnaissance vocale et synthèse vocale.",
  "pr_focus_point_desc": "Application \"Tout en un\" fournie avec des outils d'organisation et de gestion du temps. Développement axé sur le mobile.",
  "pr_cool_rainbows_desc": "Un de mes premiers codes poussés vers github, conçu pour apprendre et s'amuser. Fondamentalement, un sélecteur de couleurs dans Vanilla JS.",
  "see_more": "Voir plus",
  "get_in_touch": "Entrez en contact avec moi",
  "email": "E-mail",
  "name": "Nom",
  "subject": "Sujet",
  "message": "Message",
  "send": "Envoyer",

  "and": "et",

  "landing1": "Je m'appelle Leonel, je suis passionné par la technologie et je cherche toujours à apprendre quelque chose de nouveau.",
  "landing2": "Je travaille en tant que développeur full-stack depuis quelques années et durant cette période j'ai eu l'opportunité de travailler avec différentes technologies.",
  "landing3": "Actuellement, je cherche à approfondir le domaine de la cybersécurité. je suis en formation à",
  "landing4": "me familiariser avec les techniques et les outils utilisés dans l'exploitation des vulnérabilités Web, ainsi que dans l'atténuation et la prévention.",
  "landing5": "Je souhaite développer les connaissances pratiques et théoriques nécessaires pour travailler dans le domaine.",
  "landing6": "Pour aller plus loin, je suis un père fier et, dans mes temps libres : artiste, tatoueur, écrivain en herbe, joueur, entre autres.",
  "landing7": "N'hésitez pas à me contacter",
  "get_contact": "Entrer en contact"
}
