{
  "i_am": "Je suis a",
  "br": "Brazil",
  "about_desc": "Créatif, dévoué et toujours prêt à apprendre. Embauchez-moi et je préparerai les meilleures pâtes dans l'assiette que vous aurez mangées (ou vous serez remboursé).",
  "race": "Course",
  "class": "Classe",
  "human": "Humain",
  "about": "À propos",
  "tech": "Tech",
  "technologies": "Les technologies",
  "contact": "Contact",

  "my_projects": "Certains de mes projets",
  "pr_message_board_desc": "Tableau de messages imitant certaines fonctionnalités courantes des réseaux sociaux, telles que: l'enregistrement et l'accès des utilisateurs, le profil, les publications, les likes.",
  "pr_weather_app_desc": "Application de prévisions météorologiques qui utilise l'API publique openWeather.",
  "pr_virtual_assistant_desc": "Assistant personnel personnalisable avec reconnaissance vocale et synthèse vocale.",
  "pr_focus_point_desc": "Application \"Tout en un\" fournie avec des outils d'organisation et de gestion du temps. Développement axé sur le mobile.",
  "pr_cool_rainbows_desc": "Un de mes premiers codes poussés vers github, conçu pour apprendre et s'amuser. Fondamentalement, un sélecteur de couleurs dans Vanilla JS.",
  "pr_lazyos_desc": "Outil d'énumération de sous-domaines Osint.",
  "get_in_touch": "Entrez en contact avec moi",
  "email": "E-mail",
  "name": "Nom",
  "subject": "Sujet",
  "message": "Message",
  "send": "Envoyer",

  "and": "et",

  "title_experience": "Expérience",
  "title_projects": "Projets",
  "title_contact": "Entrer en contact :)",

  "landing1": "Je m'appelle Leonel, je suis passionné par la technologie et je cherche toujours à apprendre quelque chose de nouveau.",
  "landing2": "Je travaille en tant que développeur full-stack depuis quelques années et durant cette période j'ai eu l'opportunité de travailler avec différentes technologies.",
  "landing3": "Actuellement, je cherche à approfondir le domaine de la cybersécurité. je suis en formation à",
  "landing4": "me familiariser avec les techniques et les outils utilisés dans l'exploitation des vulnérabilités Web, ainsi que dans l'atténuation et la prévention.",
  "landing5": "Je souhaite développer les connaissances pratiques et théoriques nécessaires pour travailler dans le domaine.",
  "landing6": "Pour aller plus loin, je suis un père fier et, dans mes temps libres : artiste, tatoueur, écrivain en herbe, joueur, entre autres.",
  "landing7": "N'hésitez pas à me contacter",
  "get_contact": "Entrer en contact",

  "tech1": "Comme mentionné précédemment, au cours de ma carrière de développeur j'ai eu l'opportunité de travailler avec plusieurs langages et technologies. Parmi eux, je peux souligner : Javascript principalement à travers le framework React, Node, Python et Laravel.  n Je me suis également lancé dans la création de jeux avec le moteur Unity, en utilisant C#. J'ai même travaillé dans ce domaine pendant une brève période en tant que professeur suppléant. \n Même si j'ai encore beaucoup à apprendre, je peux dire que j'ai travaillé avec différents designs. Patterns. J'ai toujours essayé de prêter attention aux concepts de code SOLIDE et propre pour construire un code propre, réutilisable et évolutif.",
  "tech2": "J'étudie la cybersécurité et réalise des CTF au quotidien, principalement via Portswigger Academy et TryHackMe. Ce qui me permet d'acquérir beaucoup de connaissances théoriques, mais aussi de les appliquer de manière pratique.",
  "tech3": "J'utilise Linux avant même de commencer ma carrière dans la Tech et je suis plutôt à l'aise avec un terminal. J'utilise Mint (et Kali) au quotidien, mais je joue aussi avec d'autres distributions.",
  "tech4": "J'ai de l'expérience dans l'utilisation de bases de données relationnelles comme MySQL et Postgres, en interagissant avec elles manuellement et via des ORM tels qu'Eloquent et Sequelize. \n J'ai également de bonnes compétences en matière de gestion de versions avec git et de gestion des conteneurs Docker.",
  "tech5": "J'ai hébergé des applications full-stack sur des VM GCP Compute Engine, en configurant Nginx comme proxy inverse et en utilisant pm2 pour la persistance des processus. \n J'ai implémenté des API Restful et utilisé des outils comme Postman pour les tests.",
  "tech6": "Presque ou aussi important, je suis une personne dévouée et créative. Chaque jour et chaque obstacle est une opportunité d'apprendre quelque chose de nouveau. Nos plus grands alliés sont Google et les documentations, et je suis capable de rechercher et de surfer eux :)",
  "see_more": "Voir plus",
  "seen_all": "Entre autres",
  "tech_stack": "Un peu de mon répertoire",

  "professional": "Professionnel",
  "academic": "Académique",
  "complementary": "Complémentaire",
  "full_dev": "Développeur full-stack",
  "ux_designer": "Concepteur UX",
  "cybersec_enthusiast": "Passionné de cybersécurité",
  "artist_designer": "Artiste et Designer",
  "tattooer": "Tatoueur",
  "writer_wannabe": "Écrivain en herbe",
  "comp_tech": "Technicien informatique",
  "sub_teacher": "Professeur de programmation suppléant",
  "freela_art": "Arts et design indépendants",
  "waiter": "Serveur",
  "software_engineering": "Génie logiciel",
  "ead_info_sys": "EaD Systèmes d'information",
  "bi_arts_design": "B.I en Arts et Design",
  "modern_web_dev": "Développement Web moderne",
  "art_expos": "Expositions Artistiques",
  "present": "présent",
  "interrupted": "[Interrompu]",
  "desc_fmu": "Mise en œuvre de nouvelles fonctionnalités, corrections de bugs et maintenance du code dans la course à la digitalisation de l'entreprise et au remplacement des systèmes existants.",
  "desc_health": "En plus de travailler sur le développement, j'ai également contribué aux problèmes d'UI et d'UX. Au cours de mon séjour chez Health ID, j'ai pu beaucoup évoluer professionnellement.",
  "desc_ibx": "J'ai effectué les réparations nécessaires, qui allaient du simple formatage au remplacement de pièces. Le contrat a été résilié prématurément en raison de complications liées à la pandémie.",
  "desc_happy": "Création de matériel et préparation de cours de programmation, axés sur le développement de jeux, enseignés aux enfants et adolescents.",
  "desc_art": "Cherchant à comprendre les besoins de mes clients, j'ai appliqué mes connaissances de manière créative, en visant des livraisons innovantes et de qualité.",
  "desc_expo_art": "Exposition de certaines de mes peintures dans différents bars et studios de ma ville.",
  "desc_thm_path": "Les CTFs sont des défis pratiques où il faut utiliser diverses techniques de cybersécurité pour capturer un \"drapeau\". Les parcours d'apprentissage sont des itinéraires éducatifs composés de leçons et de supports complémentaires.",
  "desc_fiap_cybersec": "Ce cours de la FIAP couvre les piliers de la cybersécurité et son application pour protéger les systèmes. Les sujets incluent le chiffrement, l'analyse des vulnérabilités, l'ingénierie sociale et les frameworks pour les tests d'intrusion.",

  "err_invalid_email": "Veuillez saisir un email valide",
  "err_subject_length": "Le sujet doit comporter au maximum 255 caractères",
  "err_message_length": "Le message doit contenir au maximum 512 caractères",
  "err_required_field": "Ce champ est obligatoire",
  "contact_toast_success": "Envoyé avec succès, je vous répondrai bientôt !",
  "contact_toast_error": "Erreur d'envoi du message !"
}
